alefragnani.bookmarks
amodio.tsl-problem-matcher
anoff.theme-monokai-light
ansenhuang.vscode-view-readme
anthropic.claude-code
arcticicestudio.nord-visual-studio-code
atommaterial.a-file-icon-vscode
austin.code-gnu-global
barbosshack.crates-io
batisteo.vscode-django
bbenoist.qml
be5invis.theme-verdandi
better-ts-errors.better-ts-errors
bierner.comment-tagged-templates
bierner.emojisense
bierner.jsdoc-markdown-highlighting
bierner.markdown-checkbox
bierner.markdown-emoji
bierner.markdown-preview-github-styles
bjarne.ethereal-omarchy
bjarne.hackerman-omarchy
bradlc.vscode-tailwindcss
catppuccin.catppuccin-vsc
christian-kohler.npm-intellisense
curve.nord-dark-pro
danielpinto8zz6.c-cpp-compile-run
dbaeumer.vscode-eslint
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
dprint.dprint
drewxs.tokyo-night-dark
dunstontc.dark-plus-syntax
eamodio.gitlens
eclipse-cdt.vscode-clangd-cdtcloud
eduardo-np.eduardonp-dark
eleven01.solidity
emeraldwalk.runonsave
enkia.tokyo-night
esbenp.prettier-vscode
expo.vscode-expo-tools
extr0py.vscode-relative-line-numbers
fill-labs.dependi
formulahendry.code-runner
fresh-milkshake.qml-language-highlighting
ganeshgaddhe.ice-age-theme
github.github-vscode-theme
github.vscode-github-actions
golang.go
google.colab
gustavoinacio.oled-neon-theme
hbenl.vscode-test-explorer
infeng.vscode-react-typescript
jaakko.black
james-yu.latex-workshop
jdinhlife.gruvbox
jeff-hykin.better-cpp-syntax
jeongukjae.vscode-protobuf
josetr.cmake-language-support-vscode
jovejonovski.ocean-green
juanblanco.solidity
kevinrose.vsc-python-indent
lawrencegrant.cql
llvm-vs-code-extensions.vscode-clangd
matepek.testmate-cpp-legacy
matepek.vscode-catch2-test-adapter
max-ss.cyberpunk
mechatroner.rainbow-csv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dotnettools.vscode-dotnet-runtime
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.datawrangler
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
ms-vscode.test-adapter-converter
ms-vscode.vscode-typescript-next
mvllow.rose-pine
mylesmurphy.prettify-ts
njpwerner.autodocstring
nodenest.readme-markdown-viewer
nomicfoundation.hardhat-solidity
npclaudiu.vscode-gn
openai.chatgpt
oven.bun-vscode
pmneo.tsimporter
prime31.zig
qufiwefefwoyn.kanagawa
qwenlm.qwen-code-vscode-ide-companion
rbbit.typescript-hero
rbuckton.tsserver-live-reload
redhat.vscode-yaml
rust-lang.rust-analyzer
rustcc.rust-analyzer-cn
rvest.vs-code-prettier-eslint
sadeedpv.code-explainer
sainnhe.everforest
saoudrizwan.claude-dev
sclu1034.justfile
securedev01.vscode-multi-themes
serayuzgur.crates
sixth.sixth-ai
stringham.move-ts
tahayvr.matteblack
tamasfe.even-better-toml
teabyii.ayu
theqtcompany.qt-core
theqtcompany.qt-qml
tialki.tex-preview
tintinweb.vscode-solidity-flattener
tomoki1207.pdf
twxs.cmake
typescriptteam.native-preview
usernamehw.errorlens
vadimcn.vscode-lldb
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscodevim.vim
wakatime.vscode-wakatime
wholroyd.jinja
xaver.clang-format
yoavbls.pretty-ts-errors
ziglang.vscode-zig
zoxon.monokai-light
zxh404.vscode-proto3
